
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Для Каждого СтрокаТЧ Из ТЧ_Мониторинг Цикл 
		МенеджерЗаписи = РегистрыСведений.РезультатыСопоставления.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаТЧ);
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() И НЕ МенеджерЗаписи.Обработано Тогда 
			МенеджерЗаписи.Обработано = Истина;
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;
		МенеджерЗаписи = РегистрыСведений.РезультатыМониторингаЦен.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаТЧ);
		МенеджерЗаписи.Комментарий = "Мониторинг (" + Ответственный + "): " + МенеджерЗаписи.Комментарий;
		МенеджерЗаписи.Записать(Истина);
	КонецЦикла;
КонецПроцедуры
