
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураПараметров = Параметры.СтрутураПараметров;
	ДекорацияЗаголовок = "";
	Адрескартинки = "";
	ЭтоСсылка = Ложь;
	Если СтруктураПараметров.Свойство("Заголовок", ДекорацияЗаголовок) Тогда 
		Элементы.ДекорацияЗаголовок.Заголовок = ДекорацияЗаголовок;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("АдресКартинки", Адрескартинки) Тогда 
		Если СтруктураПараметров.Свойство("ЭтоСсылка", ЭтоСсылка) И ЭтоСсылка Тогда 
			ПолеКартинка = Адрескартинки;
		Иначе 
			ПолеКартинка =  "<html>
			        |<body> <div align = center>
			        |<img width = auto height = 100% src='"+Адрескартинки+"'/> </div>
			        |</body>
			        |</html>";
		КонецЕсли;
	КонецЕсли;
	Если НЕ СтруктураПараметров.Свойство("ЗаголовокФормы", Заголовок) Тогда 
		Заголовок = "Просмотр фото";
	КонецЕсли;

КонецПроцедуры
