
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.РезультатыМониторинга.Записывать = Истина;//Ден  2017 11 30 --- подчинение регистратору	
	// регистр РезультатыМониторинга
	МассивНоменклатуры = Новый Массив;
	Для Каждого ТекСтрокаРезультатыМониторинга Из РезультатыМониторинга Цикл
		Для Каждого Магазин Из Конкурент.Магазины Цикл 
			Движение = Движения.РезультатыМониторинга.Добавить();//Ден  2017 11 30 --- подчинение регистратору
			Движение.ДатаМониторинга = Дата;
			Движение.Конкурент = Конкурент;
			Движение.Номенклатура = ТекСтрокаРезультатыМониторинга.Номенклатура;
			Движение.ИсполнительМагазин = ИсполнительМагазин;
			Движение.ЦенаКонкурента = ТекСтрокаРезультатыМониторинга.ЦенаКонкурента;
			Движение.Акция = ТекСтрокаРезультатыМониторинга.Акция;
			Движение.Пропущено = ТекСтрокаРезультатыМониторинга.Пропущено;
			Движение.Отсутствует = ТекСтрокаРезультатыМониторинга.Отсутствует;
			Движение.ИменаКартинок = ТекСтрокаРезультатыМониторинга.ИменаКартинок;
			Движение.Магазин = Магазин.Магазин;
			Движение.ТипМониторинга = ТипМониторинга;
			Движение.КомментарийКНоменклатуре = ТекСтрокаРезультатыМониторинга.Комментарий;
		КонецЦикла;
		
		Если ТекСтрокаРезультатыМониторинга.ЦенаКонкурента Тогда 
			МассивНоменклатуры.Добавить(ТекСтрокаРезультатыМониторинга.Номенклатура);
		КонецЕсли;
	КонецЦикла;

	// регистр ЦеныКонкурентов
	Движения.ЦеныКонкурентов.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныКонкурентовСрезПоследних.Цена,
		|	ЦеныКонкурентовСрезПоследних.Период,
		|	ЦеныКонкурентовСрезПоследних.Номенклатура
		|ИЗ
		|	РегистрСведений.ЦеныКонкурентов.СрезПоследних(
		|			&ДатаСреза,
		|			Номенклатура В (&МассивНоменклатуры)
		|				И Конкурент = &Конкурент) КАК ЦеныКонкурентовСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", Дата-1);
	Запрос.УстановитьПараметр("Конкурент", Конкурент);
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	
	ТЗ_Поиск = Запрос.Выполнить().Выгрузить();
	ТЗ_Поиск.Индексы.Добавить("Номенклатура");
	
	Для Каждого ТекСтрокаРезультатыМониторинга Из РезультатыМониторинга Цикл
		Если ТекСтрокаРезультатыМониторинга.ЦенаКонкурента>0 И ЗначениеЗаполнено(ТекСтрокаРезультатыМониторинга.Номенклатура) Тогда 
			Движение = Движения.ЦеныКонкурентов.Добавить();
			Движение.Период = Дата;
			Движение.Конкурент = Конкурент;
			Движение.Номенклатура = ТекСтрокаРезультатыМониторинга.Номенклатура;
			Движение.Цена = ТекСтрокаРезультатыМониторинга.ЦенаКонкурента;
			СтрокаПоиск = ТЗ_Поиск.Найти(ТекСтрокаРезультатыМониторинга.Номенклатура, "Номенклатура");
			Если НЕ СтрокаПоиск = Неопределено Тогда 
				Движение.ДатаПрошлойЦены = СтрокаПоиск.Период;
				Движение.ПрошлаяЦена = СтрокаПоиск.Цена;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
