&НаСервере
Функция ТекущийПользователь() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	ТекПользователь = Справочники.Пользователи.НайтиПоКоду(ПользователиИнформационнойБазы.ТекущийПользователь());
	Если ТекПользователь.Пустая() Тогда 
		НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
		НовыйПользователь.Код = ПользователиИнформационнойБазы.ТекущийПользователь();
		НовыйПользователь.Наименование = НовыйПользователь.Код;
		НовыйПользователь.Записать();
		ТекПользователь = НовыйПользователь.Ссылка;
	КонецЕсли;

	Возврат ТекПользователь;

КонецФункции // ТекущийПользователь() //

&НаСервере
Функция ВычислитьВремяПути(ИсхШ, ИсхД, НазнШ, НазнД) Экспорт
	
	вхИмяФайла = КаталогВременныхФайлов() + "Geo.xml";
	
	GKey = Константы.GoogleAPIKey.Получить();
	Соед = Новый HTTPСоединение("maps.googleapis.com/maps/api/directions/",,,,, Истина);
	Ответ = Соед.Получить("xml?origin=" + СтрЗаменить(Строка(ИсхШ),",",".") + "," + СтрЗаменить(Строка(ИсхД),",",".") + "&destination=" + СтрЗаменить(Строка(НазнШ),",",".") + "," + СтрЗаменить(Строка(НазнД),",",".") + "&sensor=false&mode=walking&key=" + GKey, вхИмяФайла);

	мДОМ=новый ПостроительDOM;              
	
	чтение=Новый ЧтениеXML ;
	чтение.ОткрытьФайл(сокрЛП(вхИмяФайла));
	мДокументДОМ=мДОМ.Прочитать(чтение);
	чтение.Закрыть();
	
	мРазыменовательПИ=мДокументДОМ.СоздатьРазыменовательПИ(мДокументДОМ);
	
	мЗапрос = "/DirectionsResponse/route/leg/duration/value";
	мХПуть = мДокументДОМ.СоздатьВыражениеXPath(мЗапрос,мРазыменовательПИ);
	мРезультат = мХПуть.Вычислить(мДокументДОМ);
	мВремя = мРезультат.ПолучитьСледующий();
	Время = мВремя.ТекстовоеСодержимое;
	
	Возврат Время;
	
КонецФункции

&НаСервере
Процедура ПолучитьКоординатыНаСервере(Объект) Экспорт
	
	вхИмяФайла = КаталогВременныхФайлов() + "Geo.xml"; 
	Соед = Новый HTTPСоединение("maps.googleapis.com/maps/api/geocode/");
    Ответ = Соед.Получить("xml?address=" + Объект.Адрес + "&sensor=true_or_false", вхИмяФайла);
	
	мДОМ=новый ПостроительDOM;
	
	чтение=Новый ЧтениеXML ;
	чтение.ОткрытьФайл(сокрЛП(вхИмяФайла));
	мДокументДОМ=мДОМ.Прочитать(чтение);
	чтение.Закрыть();
	
	мРазыменовательПИ=мДокументДОМ.СоздатьРазыменовательПИ(мДокументДОМ);
	
	мЗапрос = "/GeocodeResponse/result/geometry/location/lat";
	мХПуть = мДокументДОМ.СоздатьВыражениеXPath(мЗапрос,мРазыменовательПИ);
	мРезультат = мХПуть.Вычислить(мДокументДОМ);
	мШирота = мРезультат.ПолучитьСледующий();
	Объект.Широта = мШирота.ТекстовоеСодержимое;
	
	мЗапрос = "/GeocodeResponse/result/geometry/location/lng";
	мХПуть = мДокументДОМ.СоздатьВыражениеXPath(мЗапрос,мРазыменовательПИ);
	мРезультат = мХПуть.Вычислить(мДокументДОМ);
	мДолгота = мРезультат.ПолучитьСледующий();
	Объект.Долгота = мДолгота.ТекстовоеСодержимое;
	
КонецПроцедуры