
Процедура ОбработкаПроведения(Отказ, Режим)
	//Ден  2017 11 30 ---новый регистр по статусам	
	движения.СостояниеМониторингаПозиций.Записывать = Истина;
	Для Каждого ПозицияСопоставления Из Сопоставление Цикл
		Движение = Движения.СостояниеМониторингаПозиций.Добавить();
		Движение.Номенклатура = ПозицияСопоставления.Номенклатура;
		Движение.Конкурент = ПозицияСопоставления.Конкурент;
		Движение.Цена = ПозицияСопоставления.ЦенаКонкурента;
		Движение.ДатаМониторинга = ПозицияСопоставления.ДатаМониторинга;
		Движение.ДатаСтатуса = Дата;
		Если ПозицияСопоставления.СопоставлениеКорректно = 0 Тогда
			Движение.Статус = Перечисления.СтатусыМониторинга.СопоставлениеНекорректно;
		ИначеЕсли ПозицияСопоставления.СопоставлениеКорректно = 1 Тогда
			Движение.Статус = Перечисления.СтатусыМониторинга.СопоставлениеКорректно;
		ИначеЕсли ПозицияСопоставления.СопоставлениеКорректно = 2 Тогда
			Движение.Статус = Перечисления.СтатусыМониторинга.СопоставлениеОжидается;
		КонецЕсли;
		Движение.Комментарий = ПозицияСопоставления.Комментарий;
	КонецЦикла;
	//---
КонецПроцедуры

