
Процедура ОбработкаПроведения(Отказ, Режим)
	//Ден  2017 11 30 ---новый регистр по статусам	
	движения.СостояниеМониторингаПозиций.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_Сопоставление Из Сопоставление Цикл
		Движение = Движения.СостояниеМониторингаПозиций.Добавить();
		Движение.Номенклатура = ТекСтрокаТЧ_Сопоставление.Номенклатура;
		Движение.Конкурент = ТекСтрокаТЧ_Сопоставление.Конкурент;
		Движение.ДатаМониторинга = ТекСтрокаТЧ_Сопоставление.ДатаМониторинга;
		Если ТекСтрокаТЧ_Сопоставление.СопоставлениеКорректно = 0 Тогда
			Движение.Статус = Перечисления.СтатусыМониторинга.СопоставлениеНекорректно;
		ИначеЕсли ТекСтрокаТЧ_Сопоставление.СопоставлениеКорректно = 1 Тогда
			Движение.Статус = Перечисления.СтатусыМониторинга.СопоставлениеКорректно;
		ИначеЕсли ТекСтрокаТЧ_Сопоставление.СопоставлениеКорректно = 2 Тогда
			Движение.Статус = Перечисления.СтатусыМониторинга.СопоставлениеОжидается;
		КонецЕсли;
		Движение.Комментарий = ТекСтрокаТЧ_Сопоставление.Комментарий;
	КонецЦикла;
	//---
КонецПроцедуры

