
Процедура ОбработкаПроведения(Отказ, Режим)
	//Ден  2017 11 30 ---новый регистр по статусам	
	движения.СостояниеМониторингаПозиций.Записывать = Истина; 
	Для Каждого ТекСтрокаТЧ_Сопоставление Из ТЧ_Сопоставление Цикл
		Если ТекСтрокаТЧ_Сопоставление.СопоставлениеКорректно <> 2 Тогда 
			Движение = Движения.СостояниеМониторингаПозиций.Добавить();
			Движение.Номенклатура = ТекСтрокаТЧ_Сопоставление.Номенклатура;
			Движение.Конкурент = ТекСтрокаТЧ_Сопоставление.Конкурент;
			Движение.ДатаМониторинга = ТекСтрокаТЧ_Сопоставление.ДатаМониторинга;
			Если ТекСтрокаТЧ_Сопоставление.СопоставлениеКорректно = 0 Тогда
				Движение.Статус = Перечисления.СтатусыМониторинга.СопоставлениеНекорректно;
			ИначеЕсли ТекСтрокаТЧ_Сопоставление.СопоставлениеКорректно = 1 Тогда
				Движение.Статус = Перечисления.СтатусыМониторинга.СопоставлениеКорректно;		
			КонецЕсли;
			Движение.Комментарий = ТекСтрокаТЧ_Сопоставление.Комментарий;	
		КонецЕсли;
	КонецЦикла;
	//---
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Для Каждого СтрокаТЧ Из ТЧ_Сопоставление Цикл
			// 0 - сопоставление не корректно;
			// 1 - сопоставление корректно;
			// 2 - сопоставление не проводилось.
			Если СтрокаТЧ.СопоставлениеКорректно = 2 ИЛИ (СтрокаТЧ.СопоставлениеКорректно = 0 И СтрокаТЧ.Комментарий = "") Тогда
				Отказ = Истина;
				Сообщить("Есть строки без сопоставления или комментария к некорректному сопоставлению! Запустите проверку результата.");
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры