
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр РезультатыСопоставления
	Для Каждого ТекСтрокаТЧ_Сопоставление Из ТЧ_Сопоставление Цикл
		Если ТекСтрокаТЧ_Сопоставление.СопоставлениеКорректно = 1 Тогда 
			Движение = РегистрыСведений.РезультатыСопоставления.СоздатьМенеджерЗаписи();
			Движение.Номенклатура = ТекСтрокаТЧ_Сопоставление.Номенклатура;
			Движение.Конкурент = ТекСтрокаТЧ_Сопоставление.Конкурент;
			Движение.ЦенаКонкурента = ТекСтрокаТЧ_Сопоставление.ЦенаКонкурента;
			Движение.ИменаКартинок = ТекСтрокаТЧ_Сопоставление.ИменаКартинок;
			Движение.ДатаМониторинга = ТекСтрокаТЧ_Сопоставление.ДатаМониторинга;
			Движение.ТипМониторинга = ТекСтрокаТЧ_Сопоставление.ТипМониторинга;
			Движение.КомментарийКНоменклатуре = ТекСтрокаТЧ_Сопоставление.КомментарийКНоменклатуре;
			
			Движение.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
	//Обработка изменения признака отработано у записей, попавших в отбор
	Для Каждого СтрокаТЧ Из ТЧ_РезультатОтбора Цикл 
		МенеджерЗаписи = РегистрыСведений.РезультатыМониторинга.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаТЧ);
		МенеджерЗаписи.Магазин = СтрокаТЧ.Исполнитель;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() И НЕ МенеджерЗаписи.Обработано Тогда 
			МенеджерЗаписи.Обработано = Истина;
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Для Каждого СтрокаТЧ Из ТЧ_Сопоставление Цикл
			// Кириллов А. Значения реквизита СопоставлениеКорректно:
			// 0 - сопоставление не корректно;
			// 1 - сопоставление корректно;
			// 2 - сопоставление не проводилось.
			// Ошибка в редакции 1-Бит:
			// Если СтрокаТЧ.СопоставлениеКорректно = 0 Тогда
			Если СтрокаТЧ.СопоставлениеКорректно = 2 ИЛИ (СтрокаТЧ.СопоставлениеКорректно = 0 И СтрокаТЧ.Комментарий = "") Тогда
				Отказ = Истина;
				Сообщить("Есть строки без сопоставления или комментария к некорректному сопоставлению! Запустите проверку результата.");
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры