&НаКлиенте
Процедура ПолучитьКоординаты(Команда)
	ПолучитьКоординатыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьКоординатыНаСервере()
	ОбщегоНазначения.ПолучитьКоординатыНаСервере(Объект);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВремяНаСервере()
	Для Каждого Стр Из Объект.Магазины Цикл
		Попытка
			Время = ОбщегоНазначения.ВычислитьВремяПути(Стр.Магазин.Широта, Стр.Магазин.Долгота, Объект.Широта, Объект.Долгота);
		Исключение
			Время = 0;
		КонецПопытки;
		Стр.ВремяПешком = Время;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВремя(Команда)
	ЗаполнитьВремяНаСервере();
КонецПроцедуры
